// 数据与配置

const CONFIG = {
  point: 4,
  max: 2048,
}

const DATA = {
  score: 0,
  best: 0,
  tiles: [],
}

const POSITION = [
  // left: dir = 0
  [
    [0, 1, 2, 3],
    [4, 5, 6, 7],
    [8, 9, 10, 11],
    [12, 13, 14, 15],
  ],
  // top: dir = 1
  [
    [0, 4, 8, 12],
    [1, 5, 9, 13],
    [2, 6, 10, 14],
    [3, 7, 11, 15],
  ],
  // right: dir = 2
  [
    [3, 2, 1, 0],
    [7, 6, 5, 4],
    [11, 10, 9, 8],
    [15, 14, 13, 12],
  ],
  // bottom: dir = 3
  [
    [12, 8, 4, 0],
    [13, 9, 5, 1],
    [14, 10, 6, 2],
    [15, 11, 7, 3],
  ],
]

export { CONFIG, DATA, POSITION }
